src/test/resources/performancetest/report_combined/statistics.json
{
  "POST /api/quiz/1/submit" : {
    "transaction" : "POST /api/quiz/1/submit",
    "sampleCount" : 1417,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.6979534227240635,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 16.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 4.0,
    "throughput" : 58.56581938417028,
    "receivedKBytesPerSec" : 19.24015809051457,
    "sentKBytesPerSec" : 13.440398003203141
  },
  "POST /api/quiz/2/submit" : {
    "transaction" : "POST /api/quiz/2/submit",
    "sampleCount" : 1417,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.716302046577276,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 20.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 4.819999999999936,
    "throughput" : 58.59730377967083,
    "receivedKBytesPerSec" : 19.251672537941445,
    "sentKBytesPerSec" : 13.447623425998678
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 8500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.6737647058823524,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 56.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 5.0,
    "throughput" : 349.77984445084564,
    "receivedKBytesPerSec" : 152.87288042415952,
    "sentKBytesPerSec" : 71.73219466277108
  },
  "POST /api/quiz/3/submit" : {
    "transaction" : "POST /api/quiz/3/submit",
    "sampleCount" : 1416,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.7153954802259901,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 20.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 4.0,
    "throughput" : 58.58259898225146,
    "receivedKBytesPerSec" : 19.24681824293575,
    "sentKBytesPerSec" : 13.44424878987216
  },
  "GET /api/quiz/1" : {
    "transaction" : "GET /api/quiz/1",
    "sampleCount" : 1417,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.6690190543401558,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 56.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 4.0,
    "throughput" : 58.31515700234578,
    "receivedKBytesPerSec" : 29.784010851784025,
    "sentKBytesPerSec" : 10.53545316936911
  },
  "GET /api/quiz/2" : {
    "transaction" : "GET /api/quiz/2",
    "sampleCount" : 1417,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.6210303458009887,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 12.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 5.0,
    "throughput" : 58.5900351457515,
    "receivedKBytesPerSec" : 34.272881887016744,
    "sentKBytesPerSec" : 10.585113771449246
  },
  "GET /api/quiz/3" : {
    "transaction" : "GET /api/quiz/3",
    "sampleCount" : 1416,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.6228813559322042,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 10.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 5.0,
    "throughput" : 58.5777520373971,
    "receivedKBytesPerSec" : 31.691479129607416,
    "sentKBytesPerSec" : 10.582894655193812
  }
}