src/test/resources/performancetest/report_normal/statistics.json
{
  "POST /api/quiz/1/submit" : {
    "transaction" : "POST /api/quiz/1/submit",
    "sampleCount" : 417,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.220623501199041,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 28.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 9.639999999999986,
    "throughput" : 44.795359329680956,
    "receivedKBytesPerSec" : 14.71484249113761,
    "sentKBytesPerSec" : 10.280185002417017
  },
  "POST /api/quiz/2/submit" : {
    "transaction" : "POST /api/quiz/2/submit",
    "sampleCount" : 417,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.146282973621103,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 30.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 7.819999999999993,
    "throughput" : 44.88214401033258,
    "receivedKBytesPerSec" : 14.74335041976106,
    "sentKBytesPerSec" : 10.300101408621247
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.1036000000000008,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 78.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 8.0,
    "throughput" : 265.02703275734126,
    "receivedKBytesPerSec" : 115.83161755936605,
    "sentKBytesPerSec" : 54.35124695218912
  },
  "POST /api/quiz/3/submit" : {
    "transaction" : "POST /api/quiz/3/submit",
    "sampleCount" : 416,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.1201923076923068,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 10.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 7.829999999999984,
    "throughput" : 44.85175202156334,
    "receivedKBytesPerSec" : 14.739407850404312,
    "sentKBytesPerSec" : 10.293126684636118
  },
  "GET /api/quiz/1" : {
    "transaction" : "GET /api/quiz/1",
    "sampleCount" : 417,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.2374100719424466,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 78.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 4.099999999999966,
    "pct3ResTime" : 10.639999999999986,
    "throughput" : 44.21588378750928,
    "receivedKBytesPerSec" : 22.582917207878275,
    "sentKBytesPerSec" : 7.988221192079314
  },
  "GET /api/quiz/2" : {
    "transaction" : "GET /api/quiz/2",
    "sampleCount" : 417,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.0167865707434065,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 13.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 7.819999999999993,
    "throughput" : 44.862829478214096,
    "receivedKBytesPerSec" : 26.24300279047875,
    "sentKBytesPerSec" : 8.105101028778913
  },
  "GET /api/quiz/3" : {
    "transaction" : "GET /api/quiz/3",
    "sampleCount" : 416,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.8798076923076933,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 9.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 6.829999999999984,
    "throughput" : 44.82275616851632,
    "receivedKBytesPerSec" : 24.24981144273246,
    "sentKBytesPerSec" : 8.097861221851094
  }
}