src/test/resources/performancetest/report_normal/statistics.json
{
  "POST /api/quiz/1/submit" : {
    "transaction" : "POST /api/quiz/1/submit",
    "sampleCount" : 72,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8.27777777777778,
    "medianResTime" : 8.0,
    "minResTime" : 2.0,
    "maxResTime" : 30.0,
    "pct1ResTime" : 12.700000000000003,
    "pct2ResTime" : 18.349999999999994,
    "pct3ResTime" : 30.0,
    "throughput" : 1.3551410664207337,
    "receivedKBytesPerSec" : 0.4459790423669797,
    "sentKBytesPerSec" : 0.31099428770397697
  },
  "POST /api/quiz/2/submit" : {
    "transaction" : "POST /api/quiz/2/submit",
    "sampleCount" : 72,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7.5555555555555545,
    "medianResTime" : 7.0,
    "minResTime" : 2.0,
    "maxResTime" : 24.0,
    "pct1ResTime" : 13.400000000000006,
    "pct2ResTime" : 17.69999999999999,
    "pct3ResTime" : 24.0,
    "throughput" : 1.347305389221557,
    "receivedKBytesPerSec" : 0.44340030875748504,
    "sentKBytesPerSec" : 0.309196061002994
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 446,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7.347533632286995,
    "medianResTime" : 6.0,
    "minResTime" : 1.0,
    "maxResTime" : 91.0,
    "pct1ResTime" : 12.0,
    "pct2ResTime" : 16.649999999999977,
    "pct3ResTime" : 26.0,
    "throughput" : 7.84838193112429,
    "receivedKBytesPerSec" : 3.4628641259876467,
    "sentKBytesPerSec" : 1.6026575175532758
  },
  "POST /api/quiz/3/submit" : {
    "transaction" : "POST /api/quiz/3/submit",
    "sampleCount" : 71,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7.929577464788734,
    "medianResTime" : 7.0,
    "minResTime" : 2.0,
    "maxResTime" : 26.0,
    "pct1ResTime" : 14.0,
    "pct2ResTime" : 17.39999999999999,
    "pct3ResTime" : 26.0,
    "throughput" : 1.359241887623241,
    "receivedKBytesPerSec" : 0.44732862903225806,
    "sentKBytesPerSec" : 0.31193539413228677
  },
  "GET /api/quiz/1" : {
    "transaction" : "GET /api/quiz/1",
    "sampleCount" : 77,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7.675324675324677,
    "medianResTime" : 5.0,
    "minResTime" : 1.0,
    "maxResTime" : 91.0,
    "pct1ResTime" : 11.600000000000009,
    "pct2ResTime" : 20.299999999999983,
    "pct3ResTime" : 91.0,
    "throughput" : 1.3648368399595867,
    "receivedKBytesPerSec" : 0.6970797532215467,
    "sentKBytesPerSec" : 0.24657696815676125
  },
  "GET /api/quiz/2" : {
    "transaction" : "GET /api/quiz/2",
    "sampleCount" : 77,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.324675324675324,
    "medianResTime" : 6.0,
    "minResTime" : 1.0,
    "maxResTime" : 21.0,
    "pct1ResTime" : 10.0,
    "pct2ResTime" : 11.199999999999989,
    "pct3ResTime" : 21.0,
    "throughput" : 1.358312164832063,
    "receivedKBytesPerSec" : 0.7945595573578182,
    "sentKBytesPerSec" : 0.24539819384173017
  },
  "GET /api/quiz/3" : {
    "transaction" : "GET /api/quiz/3",
    "sampleCount" : 77,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.441558441558442,
    "medianResTime" : 6.0,
    "minResTime" : 1.0,
    "maxResTime" : 26.0,
    "pct1ResTime" : 9.200000000000003,
    "pct2ResTime" : 15.199999999999989,
    "pct3ResTime" : 26.0,
    "throughput" : 1.368353710548763,
    "receivedKBytesPerSec" : 0.7403007379336082,
    "sentKBytesPerSec" : 0.24721234028468866
  }
}